In [1]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('./datasets/GP_data_2016_2018_기본변수+타겟+졸업대학+가족.csv')
df.head()

,연도,본분교,국공사립,학위과정유형,주야간,전공계열,전공_소분류_코드,전공_세분류_코드,학교유형,학교소재지역,...,G181G019,G181G033,G181G038,G181P001,G181P004,G181P026,G181P029,G181P035,G181P036,G181P042
0,2018,1,3,3,2,1,C010101,C01010100027,1,1,...,NaN,NaN,NaN,1,NaN,4,4,5,3,NaN
1,2018,1,3,3,1,1,C010101,C01010100013,1,1,...,NaN,NaN,NaN,1,NaN,4,4,4,3,NaN
2,2018,1,3,3,1,1,C010101,C01010100013,1,1,...,1.0,NaN,NaN,1,NaN,6,6,6,5,40.0
3,2018,1,3,3,1,1,C010101,C01010100005,1,8,...,NaN,NaN,NaN,1,NaN,6,6,6,5,NaN
4,2018,1,3,3,1,1,C010101,C01010100005,1,8,...,NaN,NaN,NaN,1,NaN,4,4,6,4,NaN

In [10]:
# G181P001
# G181P004
# G181P026
# G181P029
# G181P035
# G181P036
# G181P042

family_df = df[['G181P001',
'G181P004',
'G181P026',
'G181P029',
'G181P035',
'G181P036',
'G181P042']]

family_df.head()

   G181P001  G181P004  G181P026  G181P029  G181P035  G181P036  G181P042
0         1       NaN         4         4         5         3       NaN
1         1       NaN         4         4         4         3       NaN
2         1       NaN         6         6         6         5      40.0
3         1       NaN         6         6         6         5       NaN
4         1       NaN         4         4         6         4       NaN

# 혼인여부 및 배우자 학력

In [7]:
# 혼인여부 확인
print(family_df['G181P001'].value_counts())
print(family_df['G181P001'].isnull().sum())

# 결측값 없다

# 이혼과 사별은 미혼으로 변경
family_df['G181P001'] = family_df['G181P001'].replace(3, 1).replace(4,1)
print(family_df['G181P001'].value_counts())
print(family_df['G181P001'].isnull().sum())

1    51736
2     2536
3      112
4       59
Name: G181P001, dtype: int64
0
1    51907
2     2536
Name: G181P001, dtype: int64
0

In [11]:
# 배우자 학력 확인

print(family_df['G181P004'].value_counts())
print(family_df['G181P004'].isnull().sum())

print(family_df[['G181P001', 'G181P004']].value_counts())

# 배우자 학력 결측치를 0으로 변경 -> 0인 값은 미혼으로 판단

family_df['G181P004'] = family_df['G181P004'].fillna(0)
print(family_df['G181P004'].value_counts())
print(family_df['G181P004'].isnull().sum())

6.0    1305
4.0     523
5.0     459
7.0     176
3.0      59
2.0      13
1.0       1
Name: G181P004, dtype: int64
51907
G181P001  G181P004
2         6.0         1305
          4.0          523
          5.0          459
          7.0          176
          3.0           59
          2.0           13
          1.0            1
dtype: int64
0.0    51907
6.0     1305
4.0      523
5.0      459
7.0      176
3.0       59
2.0       13
1.0        1
Name: G181P004, dtype: int64
0

In [12]:
family_df.rename(columns={'G181P004' : '혼인여부 및 배우자 학력'} , inplace=True)

In [15]:
family_df.drop(columns=['G181P001'] , inplace=True)
family_df.columns

Index(['혼인여부 및 배우자 학력', 'G181P026', 'G181P029', 'G181P035', 'G181P036',
       'G181P042'],
      dtype='object')

# 아버지 및 어머니 학력

In [18]:
print(family_df['G181P026'].value_counts())
print(family_df['G181P026'].isnull().sum())

family_df.rename(columns={'G181P026' : '아버지 학력'} , inplace=True)

4    21538
6    18953
7     4745
5     3942
3     2907
2     2050
1      308
Name: G181P026, dtype: int64
0

In [20]:
print(family_df['G181P029'].value_counts())
print(family_df['G181P029'].isnull().sum())

family_df.rename(columns={'G181P029' : '어머니 학력'} , inplace=True)

4    29094
6    13655
5     3864
3     3211
2     2109
7     2101
1      409
Name: G181P029, dtype: int64
0

# 부모님 소득

In [23]:
print(family_df['G181P035'].value_counts())
print(family_df['G181P035'].isnull().sum())

family_df['G181P035'] = family_df['G181P035'].replace(-1,0).replace(10,0).replace(9,0)
print(family_df['G181P035'].value_counts())

 5     10367
 4     10034
 6      8731
 3      8393
 2      4636
 7      4300
 8      3346
 9      1729
 1      1528
-1       830
 10      549
Name: G181P035, dtype: int64
0
5    10367
4    10034
6     8731
3     8393
2     4636
7     4300
8     3346
0     3108
1     1528
Name: G181P035, dtype: int64

In [24]:
family_df.rename(columns={'G181P035':'부모님 소득'} , inplace=True)

# 부모님 자산

In [26]:
print(family_df['G181P036'].value_counts())
print(family_df['G181P036'].isnull().sum())

 3    14845
 4    12109
 2     9203
 1     7003
 5     6705
 6     3148
-1      921
 7      509
Name: G181P036, dtype: int64
0

In [27]:
family_df['G181P036'] = family_df['G181P036'].replace(-1,0).replace(7,0)

In [28]:
print(family_df['G181P036'].value_counts())

3    14845
4    12109
2     9203
1     7003
5     6705
6     3148
0     1430
Name: G181P036, dtype: int64

In [29]:
family_df.rename(columns={'G181P036':'부모님 자산'} , inplace=True)

# 가정의 경제적 지원

In [32]:
print(family_df['G181P042'].value_counts())
print(family_df['G181P042'].isnull().sum())
family_df['G181P042'] = family_df['G181P042'].fillna(0)

print(family_df['G181P042'].isnull().sum())
print(min(family_df['G181P042']))

30.0      2810
50.0      2224
20.0      1571
40.0      1179
100.0      722
          ...
1500.0       1
600.0        1
69.0         1
105.0        1
29.0         1
Name: G181P042, Length: 100, dtype: int64
42855
0
0.0

In [33]:
family_df.rename(columns={'G181P042':'가정의 경제적 지원'} , inplace=True)

In [34]:
family_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54443 entries, 0 to 54442
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   혼인여부 및 배우자 학력  54443 non-null  float64
 1   아버지 학력         54443 non-null  int64
 2   어머니 학력         54443 non-null  int64
 3   부모님 소득         54443 non-null  int64
 4   부모님 자산         54443 non-null  int64
 5   가정의 경제적 지원     54443 non-null  float64
dtypes: float64(2), int64(4)
memory usage: 2.5 MB

In [35]:
family_df.describe()

,혼인여부 및 배우자 학력,아버지 학력,어머니 학력,부모님 소득,부모님 자산,가정의 경제적 지원
count,54443.000000,54443.000000,54443.000000,54443.000000,54443.000000,54443.000000
mean,0.250776,4.884448,4.529379,4.356924,3.137098,9.806476
std,1.154842,1.312257,1.192840,2.014824,1.461723,29.301280
min,0.000000,1.000000,1.000000,0.000000,0.000000,0.000000
25%,0.000000,4.000000,4.000000,3.000000,2.000000,0.000000
50%,0.000000,5.000000,4.000000,4.000000,3.000000,0.000000
75%,0.000000,6.000000,6.000000,6.000000,4.000000,0.000000
max,7.000000,7.000000,7.000000,8.000000,6.000000,3000.000000

In [36]:
family_df.to_csv('GP_가족 특성(3years).csv' , index=False , encoding='utf-8-sig')